[
    {
      "name": "Portfolio Web",
      "link": "https://github.com/chelseajoint/portfolio-web",
      "about": "Diseño y desarrollo de un portfolio web personal para mostrar mis proyectos y habilidades.",
      "skills": ["JavaScript", "SCSS", "Netlify", "NodeJS", "Webpack"]
    },
    {
      "name": "Messenger para Yandex.Practicum",
      "link": "https://github.com/chelseajoint/middle.messenger.praktikum.yandex",
      "about": "Desarrollo de un completo SPA: web messenger utilizando sólo JavaScript y Typescript. <br>La idea de esta aplicación estaba en la ausencia de frameworks y librerías en el lado del cliente para entender el funccionamiento de los mismos. <br>En el trabajo sobre el proyecto se implementaron parte de las funciones de tales bibliotecas como React y React Router. <br>El proyecto incluye funciones estándar de chat: registro, autorización, lista de chat, mensajería.",
      "skills": ["TypeScript", "SCSS", "Netlify", "Heroku", "NodeJS", "Webpack", "Docker", "ESlint", "Mocha"]
    },
    {
      "name": "Un proyecto de Juego en Equipo",
      "link": "https://github.com/eldarknz/team.project.praktikum.yandex",
      "about": "Desarrollo de la lógica y funcionalidades de un juego donde el jugador es un astronauta que recoge joyas en la galaxia. <br>Las tareas realizadas por mi: Diseño de la página principal (mini landing), páginas de error 400 y 500, pruebas del motor del juego y autorización, sistema de puntuación basado en el tiempo, integración de la API del leaderboard, infraestructura del servidor para emojis, especificación y desarrollo de API para reacciones emoji.",
      "skills": ["TypeScript", "SCSS", "Webpack", "Web API", "React", "Redux", "React-Router", "NodeJS", "Docker", "ESlint", "Jest", "Web Workers", "Canvas API", "OAuth", "Nginx", "CI/CD", "SSL", "Proxy", "PostgreSQL", "MongoDB"]
    },
    {
      "name": "Octo Website",
      "link": "https://github.com/chelseajoint/octo-website",
      "about": "Desarrollo de una página web responsive como prueba.",
      "skills": ["JavaScript", "SCSS"]
    },
    {
      "name": "Tic-tac-toe",
      "link": "https://github.com/chelseajoint/tic-tac-toe",
      "about": "Implementación de una versión modificada del popular juego de tres en raya.",
      "skills": ["JavaScript"]
    },
    {
      "name": "WordSearch",
      "link": "https://github.com/chelseajoint/WordSearche",
      "about": "Desarrollo de un programa que resuelve sopas de letras para cualquier cuadrícula de letras y lista de palabras dadas.",
      "skills": ["JavaScript"]
    },
    {
      "name": "Solicitud de prestamo",
      "link": "https://github.com/chelseajoint/solicitud-prestamo-app",
      "about": "Desarrollo de una pequeña web app responsive que permite a los usuarios solicitar un préstamo desde desktop y móvil, con capacidad para registrar los datos del usuario.",
      "skills": ["JavaScript", "SCSS"]
    }
  ]
